app/controllers/passwords_controller.rb

    def update
      if current_user.update(password_params)
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2025-06-13 18:15:52.944430"], ["id", 7]]