app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."rut" = $1 LIMIT $2  [["rut", "12.345.678-9"], ["LIMIT", 1]]
---
  def create
    Rails.logger.info "Intentando iniciar sesión con parámetros: #{params.inspect}"

    rut_ingresado = params[:session][:rut].to_s.strip
    password_ingresado = params[:session][:password].to_s.strip

    if rut_ingresado.blank? || password_ingresado.blank?
      flash.now[:alert] = 'El RUT y la contraseña son obligatorios'
      return render :new, status: :unprocessable_entity
    end

    rut_normalizado = normalizar_rut(rut_ingresado)
    user = User.find_by(rut: rut_normalizado)